NordicPlayground/nrf51-watchdog-resetreas-example/nrf51-Watchdog-timer-with-softdevice/main.c
/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    // Note: Array must be static because a pointer to it will be saved in the Button handler
    //       module.
    static app_button_cfg_t buttons[] =
    {
        {WAKEUP_BUTTON_PIN, APP_BUTTON_ACTIVE_LOW, BUTTON_PULL, NULL},
        // YOUR_JOB: Add other buttons to be used:
        {WATCHDOG_RELOAD_PIN,     false, NRF_GPIO_PIN_NOPULL, button_event_handler}
    };

    APP_BUTTON_INIT(buttons, sizeof(buttons) / sizeof(buttons[0]), BUTTON_DETECTION_DELAY, true);

    // Note: If the only use of buttons is to wake up, the app_button module can be omitted, and
    //       the wakeup button can be configured by
    // GPIO_WAKEUP_BUTTON_CONFIG(WAKEUP_BUTTON_PIN);
}

void wdt_init(void)
{
	NRF_WDT->CONFIG = (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos) | ( WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos);
	NRF_WDT->CRV = 3*32768;   //ca 3 sek. timout
	NRF_WDT->RREN |= WDT_RREN_RR0_Msk;  //Enable reload register 0
	NRF_WDT->TASKS_START = 1;
}


/**@brief Function for application main entry.
 */
int main(void)
{
		int i;
	
    // Initialize
    leds_init();
    timers_init();
    gpiote_init();
    buttons_init();
    ble_stack_init();
    scheduler_init();    
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    sec_params_init();

    // Start execution
    timers_start();
    advertising_start();
	
		//BLINK LED 1 slowly during startup					
		for(i=0;i<NR_OF_STARTUP_BLINKS;i++)					
		{
			nrf_gpio_pin_toggle(LED_4);
			nrf_delay_us(DELAY);
		}
		app_button_enable();
		
		wdt_init();

    // Enter main loop
    for (;;)
    {
        app_sched_execute();
        //power_manage();
    }
}

/**
 * @}
 */
